[
	
	"When did Anakin's Jedi masters know he was leaning towards the dark side?. In the Sith Grade ",
	"Why do Doctors make the best Jedi?. Because a Jedi must have patience ",
	"How is Ducktape like the Force?. It has a Dark Side, a Light side and it binds the galaxy together ",
	"What do you call a Sith who won't fight?. A Sithy ",
	"Where does Princess Leia go shopping for clothing and such?. At the Darth Maul, of course ",
	"What do you call 5 siths piled on top of a lightsaber?. A Sith-Kabob! ",
	"Which Star Wars character uses meat for a weapon instead of a Lightsaber?. Obi Wan Baloney ",
	"Why is a droid mechanic never lonely?. Because he's always making new friends! ",
	"What did the rancor say after he ate a Wookiee?. Chewie! ",
	"What do Gungans put things in?. Jar Jars ",
	"Why did Yoda visit Bank of America yesterday?. He needed a bank clone! (Loan) ",
	"Why does Princess Leia keep her hair tied up in buns?. So it doesn't Hang Solow! ",
	"Why didn't Luke Skywalker cross the road?. Because he got a ticket for Skywalking ",
	"What does Yoda say to encourage a Padawan before a test?. Do well, you will do! ",
	"Why does Leia wear buns on her head?. In case she gets hungry in a Senate meeting ",
	"How many stormtroopers does it take to replace a lightbulb?. Two; one to screw the bulb in, the other to shoot him and take the credit ",
	"What side of an Ewok has the most hair?. The outside ",
	"Who tries to be a Jedi?. Obi-Wannabe ",
	"Which Star Wars character works at a restaurant?. Darth Waiter ",
	"What do you call a female Mandalorian?. A Womandalorian ",
	"What do Whipids say when they kiss?. Ouch ",
	"Why did the Stormtrooper start jumping up and down?. He stepped on Ant-hillies ",
	"What do Star Destroyers wear to parties?. A bow TIE ",
	"Why is Han Solo a loner?. Because he's solo ",
	"Where does Jabba the Hutt eat?. Pizza Hutt ",
	"Why did the crazy Angrallian Toobir cross the nebula?. To get to the other dementia ",
	"Why did the smuggler cross the spacelanes?. To get to the other side ",
	"What's the differance between an ATAT and a stormtrooper?. One's an Imperial walker and the other is a walking Imperial ",
	"How many Sith does it take to screw in a hyperdrive?. Two, but I don't know how they got in it ",
	"What goes, \"Ha, ha, ha, haaaa.... AGGGHHHH! Thump\"?. An Imperial Officer laughing at Darth Vader ",
	"Why did Yoda cross the road?. Because the chickens Forced him to ",
	"As a Disney character what song would Vader sing?. \"When You Wish Upon A Death Star\" ",
	"Why did the Ewok fall out of the tree?. It was dead ",
	"Where does Qui-Gon keep his jam?. In a Jar-Jar ",
	"What is Jabba the Hutt's middle name?. \"The\" ",
	"Why is the Millenium Falcon so slow?. Because it takes a millenium to go anywhere ",
	"What is a jedi's favorite toy?. A yo-yoda ",
	"Why should you never tell jokes on the Falcon?. The ship might crack up ",
	"What happens when a red and white X-Wing crashes into green water?. It gets wet ",
	"Why do Twi'leks like to flip coins?. So that they can say, \"Heads or tails!\" ",
	"What time is it when an AT-AT steps on your chronometer?. Time to get a new chronometer ",
	"Why is a droid mechanic never lonely?. Because he's always making new friends ",
	"What do Jawa's have that no other creature in the galaxy has?. Baby Jawas ",
	"What do you call a person who brings a rancor its dinner?. The appetizer ",
	"Why do vornksrs stop slowly?. They're afraid of whiplash ",
	"What's the name of the worst cantina on Coruscant?. The Ackbar ",
	"How would a fat Rogue get into his X-wing?. He'd Wedge himself in ",
	"How many Corellians does it take to change a glowpanel?. None, if the room's dark, then you can't see them cheat at sabacc",
	"Luke and Obi-Wan are in a Chinise restaurant and Luke's having trouble Finally, Obi-Wan says, \"Use the forks, Luke\""
]



